conf/src/Documents/ЭП_СлужебноеЗадание/ЭП_СлужебноеЗадание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭП_СлужебноеЗадание</name>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СлужебныеЗадания</name>
    <attributes>
      <name>Задание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

conf/src/InformationRegisters/ЭП_РассылкаСлужебныхЗаданий/ЭП_РассылкаСлужебныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_РассылкаСлужебныхЗаданий</name>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Documents/ЭП_СлужебноеЗадание/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СлужебныеЗаданияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Данные = Элементы.СлужебныеЗадания.ТекущиеДанные;
	Строки = Объект.СлужебныеЗадания.НайтиСтроки(Новый Структура("Задание", Данные.Задание));
	Если Строки.Количество() > 1 Тогда 
		Сообщить("Такая строка уже существует.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура СлужебныеЗаданияЗаданиеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Текст = СокрЛП(Текст);
КонецПроцедуры
	
&НаКлиенте
Процедура ОтправитьЗадание(Команда)
	ЭП_ФормированиеСлужебныхЗаданий.РассылкаПоказателейПЗК(Объект.Дата, Объект.Ссылка); 
	ОбновлениеДатыОтправки();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Элементы.ФормаОтправитьЗадание.Доступность = Истина;
		ОбновлениеДатыОтправки();
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Процедура ОбновлениеДатыОтправки()  
	ДатаОтправки = ПолучитьЗаписьОбОтправке(Объект.Сотрудник, Объект.Дата);
	Если ДатаОтправки = Дата(1, 1, 1, 0, 0, 0) Тогда 
		Элементы.ЗаписьОтправкиСсылка.Видимость = Ложь;
		ЗаписьОтправкиСсылка = "";
	Иначе
		ЗаписьОтправкиСсылка = СтрШаблон("Задание отправлено: %1", ДатаОтправки);
		Элементы.ЗаписьОтправкиСсылка.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗаписьОбОтправке(Сотрудник, Дата)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Записи.ДатаОтправки КАК ДатаОтправки
	                      |ИЗ
	                      |	РегистрСведений.ЭП_РассылкаСлужебныхЗаданий КАК Записи
	                      |ГДЕ
	                      |	Записи.Месяц = &Месяц
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Записи.ДатаОтправки УБЫВ");
	
	Запрос.УстановитьПараметр("Месяц", НачалоМесяца(Дата)); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ДатаОтправки;
	КонецЕсли;
	
	Возврат Дата(1, 1, 1, 0, 0, 0);
	
КонецФункции

&НаКлиенте
Процедура ЗаписьОтправкиСсылкаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ДатаОтправки) Тогда
		ПараметрыФормы = Новый Структура("Ключ", ПолучитьКлючЗаписиОбОтправке(Объект.Дата, Объект.Сотрудник)); 
		ОткрытьФорму("РегистрСведений.ЭП_РассылкаСлужебныхЗаданий.ФормаЗаписи", ПараметрыФормы, ЭтаФорма,,
		,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
	КонецЕсли; 
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьКлючЗаписиОбОтправке(Дата, Сотрудник)                                 
	Отбор  = Новый Структура("Месяц, Сотрудник", НачалоМесяца(Дата), Сотрудник);
	Возврат РегистрыСведений.ЭП_РассылкаСлужебныхЗаданий.СоздатьКлючЗаписи(Отбор);
КонецФункции

&НаКлиенте
Процедура Просмотр(Команда)
	ТабДок = ЭП_ФормированиеСлужебныхЗаданий.ПолучитьТабДокДляСлужебногоЗадания(Объект.Дата, Объект.Ссылка);
	ТабДок.Показать();
КонецПроцедуры
